like_complex_cases = [
    {
        "query": "A/*/C",
        "operator": "~",
        "matches": [
            "A/B/C",
            "A/B/C/D",
        ],
        "no_matches": [
            "A/B/D",
            "B/C/D",
            "A/B",
            "A",
            "B",
            "C"
        ]
    }, {
        "query": "B/*",
        "operator": "~",
        "matches": [
            "A/B/C",
            "A/B/C/D",
            "B/C/D",
            "B/C",
        ],
        "no_matches": [
            "B",
            "A/B",
            "C/D",
            "A",
            "C"
        ]
    }, {
        "query": "A/*/D",
        "operator": "~",
        "matches": [
            "A/B/D",
            "A/C/D",
        ],
        "no_matches": [
            "B/C/D",
            "B/C",
            "C/D",
            "A/B/C/D",
            "A/B/C",
            "A/B",
            "B",
            "A"
        ]
    }, {
        "query": "Овощи на развес/*/Мытая картошка",
        "operator": "~",
        "matches": [
            "Овощи на развес/Сырые овощи/Мытая картошка",
            "Овощи на развес/Сырые овощи 2/Мытая картошка",
            "Овощи на развес/Сырые овощи 2/Мытая картошка/Еще что-то",
        ],
        "no_matches": [
            "A/B",
            "Овощи на развес/Сырые овощи/Мытая картошка 2",
            "Овощи на развес/Сырые овощи/Мытая картошка2",
            "Мытая картошка 2",
        ],
    }, {
        "query": "Овощи на развес/*",
        "operator": "~",
        "matches": [
            "Овощи 2/Овощи на развес/Сырые овощи/Мытая картошка",
            "Овощи на развес/Сырые овощи/Мытая картошка",
            "Овощи на развес/Сырые овощи 2/Мытая картошка",
            "Овощи на развес/Сырые овощи 2/Мытая картошка/Еще что-то",
            "Овощи на развес/Сырые овощи/Мытая картошка 2",
            "Овощи на развес/Сырые овощи/Мытая картошка2",
        ],
        "no_matches": [
            "Овощи 2/Овощи на развес",
            "Овощи на развес",
            "A/B",
            "Мытая картошка 2",
            "Овощи 2/Овощи на развес 2/Сырые овощи/Мытая картошка",
        ],
    }, {
        "query": "A/*/*/D",
        "operator": "~",
        "matches": [
            "A/B/C/D",
        ],
        "no_matches": [
            "A/B/C",
            "A/B/D",
            "B/C/D",
            "A/B",
            "A",
            "B",
            "C"
        ]
    },
]
